#
# Message properties for the eIDAS Test SP (Swedish)
#

bankid.msg.title=IDsec BankID Demo
bankid.msg.heading=IDsec BankID Demo

bankid.msg.copyright=Copyright \u00a9 Tj\u00e4nsten levereras av IDsec Solutions

bankid.msg.intro.1=Detta \u00e4r en demonstrationstj\u00e4nst som anv\u00e4nder IDsec Solutions BankID API som \u00e4r en open source \
bibliotek som g\u00f6r det enkelt att implementera BankID legitimering och underskrift i en Java-applikation. Se vidare 

bankid.msg.intro.2=Mer text ...

bankid.msg.intro.3=Mer text ...

bankid.msg.other.intro.1=Det finns tv\u00e5 s\u00e4tt att p\u00e5b\u00f6rja BankID-legitimering d\u00e5 "annan enhet" anv\u00e4nds. Antingen \
anges personnumret eller s\u00e5 uppmanas anv\u00e4ndaren l\u00e4sa av en genererad QR-kod. 

bankid.msg.auth-using=Legitimera dig med:

bankid.msg.enter-pnr=Enter personal identity number

bankid.button.this-device=BankID p\u00e5 den h\u00e4r enheten
bankid.button.other-device=BankID p\u00e5 en annan enhet
bankid.button.cancel=Avbryt
bankid.button.use-personal-id=Personnummer
bankid.button.use-qr-code=QR-kod
bankid.button.login=Logga in

sp.msg.error-heading=Ett fel intr\u00e4ffade
sp.msg.saml-error-heading=Legitimeringen misslyckades

sp.msg.intro.2=Starta din legitimering genom att v\u00e4lja ditt eID i listan nedan. Om du v\u00e4ljer "Utl\u00e4ndskt eID" kommer \
du till den svenska eIDAS-noden. D\u00e4r v\u00e4ljer du det land som du har f\u00e5tt ditt eID fr\u00e5n.

sp.msg.intro.3=Om legitimeringen lyckas styrs du tillbaka till denna tj\u00e4nst d\u00e4r information om din legitimering visas.

sp.msg.success-intro=Ditt eID fungerar f\u00f6r legitimering.
sp.msg.success-intro2=Nedan kan du se den information vi tog emot fr\u00e5n legitimeringstj\u00e4nsten.

sp.msg.cancel=Du avbr\u00f6t legitimeringen.

sp.msg.saml-error-intro=Vi tog emot ett fel fr\u00e5n legitimeringstj\u00e4nsten d\u00e4r du legitimerade dig.

sp.msg.saml-error-code-with-message=Legitimeringstj\u00e4nsten rapporterade felkoden \"{0}\" med meddelandet \"{1}\".
sp.msg.saml-error-code-no-message=Legitimeringstj\u00e4nsten rapporterade felkoden \"{0}\".
sp.msg.saml-error-only-message=Legitimeringstj\u00e4nsten rapporterade felmeddelandet: \"{0}\".

sp.msg.authn-button=Testa mitt eID
sp.msg.tryagain-button=F\u00f6rs\u00f6k igen
sp.msg.back=Tillbaka
sp.msg.more-attributes=Fler attribut >>>

sp.msg.nojs=Din webbl\u00e4sare har inte JavaScript p\u00e5slaget. D\u00e4rf\u00f6r m\u00e5ste du klicka "Forts\u00e4tt" f\u00f6r att forts\u00e4tta legitimeringen.
sp.msg.continue-button=Forts\u00e4tt

sp.msg.error.no-session=Ett responsmeddelande togs emot, men testapplikationen har ingen information om en motsvarande legitimeringsbeg\u00e4ran.
sp.msg.error.failed-request=Misslyckades skapa en legitimeringsbeg\u00e4ran.
sp.msg.error.response-processing=Bearbetningen av legitimeringens responsmeddelande indikerade felaktigheter.

sp.msg.error.not-found=Den efterfr\u00e5gade sidan finns inte.
sp.msg.error.internal=Urs\u00e4kta oss men ett internt fel har intr\u00e4ffat.

#
# Help texts
#
sp.msg.help1.title=Vad \u00e4r eIDAS?
sp.msg.help1.text1a=Du kan l\u00e4sa mer om vad eIDAS \u00e4r p\u00e5 
sp.msg.help1.text1b=och p\u00e5
sp.msg.help1.text1c=EU-kommissionens webbplats om eID och eIDAS

sp.msg.help2.title=Mitt eID fungerar h\u00e4r, men inte hos tj\u00e4nsten jag f\u00f6rs\u00f6ker n\u00e5!
sp.msg.help2.text1=Om du lyckades legitimera dig till denna tj\u00e4nst, men \u00e4nd\u00e5 inte ges tilltr\u00e4de till den svenska e-tj\u00e4nsten d\u00e4r du f\u00f6rs\u00f6ker anv\u00e4nda ditt eID \
kan det bero p\u00e5 n\u00e5gra olika saker:
sp.msg.help2.text2=M\u00e5nga svenska e-tj\u00e4nster kr\u00e4ver att ett identitetsintyg (som utf\u00e4rdas i samband med en legitimering) uppvisar ett svenskt personnummer. \
Om du inte har ett svenskt personnummer, eller om det inte finns en koppling mellan ditt eIDAS ID (som visas ovan) till ditt svenska person- eller samordningsnummer \
kan det vara s\u00e5 att vissa svenska e-tj\u00e4nster inte kan erbjuda den tj\u00e4nst du f\u00f6rs\u00f6ker n\u00e5.
sp.msg.help2.text3=Tre olika tillitsviv\u00e5er definieras inom eIDAS-samarbetet; \"l\u00e5g\", \"v\u00e4sentlig\" och \"h\u00f6g\". Om din legitimering \
utf\u00f6rs enligt en l\u00e4gre niv\u00e5 \u00e4n vad e-tj\u00e4nsten kr\u00e4ver s\u00e5 kommer du inte att beviljas \u00e5tkomst till den efterfr\u00e5gade tj\u00e4nsten.

#
# Attributes
#
sp.msg.attr-heading=Attribut f\u00f6r dig och din legitimering

sp.msg.attr.personal-id-number.name=Personnummer
sp.msg.attr.personal-id-number.eidas.name=Personnummer
sp.msg.attr.personal-id-number.eidas.desc=Ett svenskt person- eller samordningsnummer. Vid legitimering med eIDAS kopplas ditt ID \
(se nedan) till ditt svenska person- eller samordningsnummer i de fallen du har ett s\u00e5dant. De flesta svenska e-tj\u00e4nsterna kr\u00e4ver att din \
legitimering kan uppvisa ett svenskt personnummer f\u00f6r att kunna erbjuda tj\u00e4nster.

sp.msg.attr.prid.name=ID
sp.msg.attr.prid.eidas.desc=En unik identifierare for dig som person och anv\u00e4nds av svenska e-tj\u00e4nster \
som din personliga identitet. Det best\u00e5r av en landskod f\u00f6r det land d\u00e4r du legitimerade dig f\u00f6ljt av en unik identifierare f\u00f6r \
dig (som t.ex. ett personnummer).

sp.msg.attr.given-name.name=F\u00f6rnamn
sp.msg.attr.surname.name=Efternamn
sp.msg.attr.date-of-birth.name=F\u00f6delsedatum
sp.msg.attr.display-name.name=Fullst\u00e4ndigt namn

sp.msg.attr.birth-name.name=Efternamn vid f\u00f6dseln
sp.msg.attr.birth-name.eidas.desc=Efternamn vid f\u00f6dseln. Vissa l\u00e4nder inkluderar denna information till din legitimering.

sp.msg.attr.place-of-birth.name=F\u00f6delseort

sp.msg.attr.gender.name=K\u00f6n
sp.msg.attr.gender.desc=M f\u00f6r man, F f\u00f6r kvinna och U f\u00f6r \"ej angivet\".
sp.msg.attr.gender.eidas.desc=M f\u00f6r man, F f\u00f6r kvinna och U f\u00f6r \"ej angivet\".

sp.msg.attr.eidas-id.name=eIDAS identifierare
sp.msg.attr.eidas-id.eidas.desc=eIDAS identifieraren \u00e4r den unika identifierare som tilldelats dig av \
den utl\u00e4ndska legitimeringstj\u00e4nsten. Den best\u00e5r av landskoden f\u00f6r det land d\u00e4r du legitimerade dig \
f\u00f6ljt av landskoden f\u00f6r Sverige och avslutas med en unik identifierare f\u00f6r (som t.ex. ett personnummer). 

sp.msg.attr.prid-persistence.name=Persistens av ID
sp.msg.attr.prid-persistence.eidas.desc=En klassning av ett ID g\u00f6rs utifr\u00e5n hur \"persistent\" \u00f6ver tid ett s\u00e5dant ID \u00e4r. \
Det beror p\u00e5 vilket land som tilldelat ID:t. I vissa l\u00e4nder har en person ett och samma ID under hela livstiden, till exempel \
de nordiska l\u00e4nderna d\u00e4r konceptet med personnummer anv\u00e4nds. I andra l\u00e4nder kan du tilldelas ett nytt ID f\u00f6r varje eID du \
skaffar. Peristensniv\u00e5erna \u00e4r A (\u00e4ndras aldrig), B (kan \u00e4ndras, men s\u00e4llan) och C (\u00e4ndras ganska ofta).
 
sp.msg.attr.transaction-identifier.name=Transaktions-ID
sp.msg.attr.transaction-identifier.desc=En identifierare som representerar sj\u00e4lva autentiseringen hos den tj\u00e4nst, eller server, som \
anv\u00e4ndas av legitimeringstj\u00e4nsten f\u00f6r att legitimera en anv\u00e4ndare. Med hj\u00e4lp av detta ID kan ytterligare information om en \
legitimering sp\u00e5ras.
sp.msg.attr.transaction-identifier.eidas.desc=En unik identifierare f\u00f6r det identitetsintyg som togs emot fr\u00e5n den utl\u00e4ndska legitimeringstj\u00e4nsten. \
Detta intyg inneh\u00e5ller all information som visas p\u00e5 denna sida. Med detta ID kan ytterligare information om en legitimering efterfr\u00e5gas \
fr\u00e5n det land d\u00e4r legitimeringen utf\u00f6rdes.

sp.msg.attr.personal-id-number-binding.name=Personnummerkoppling
sp.msg.attr.personal-id-number-binding.eidas.desc=Om en koppling fr\u00e5n ditt ID till en svenskt person- eller samordningsnummer gjordes \
under legitimeringsfasen inneh\u00e5ller detta attribut en identifierare som talar om hur denna koppling utf\u00f6rdes.

sp.msg.authn-according-loa2=Din legitimering utf\u00f6rdes enligt tillitsniv\u00e5 2.
sp.msg.authn-according-loa3=Din legitimering utf\u00f6rdes enligt tillitsniv\u00e5 3.
sp.msg.authn-according-loa4=Din legitimering utf\u00f6rdes enligt tillitsniv\u00e5 4
sp.msg.authn-according-loa3-uncertified=Legitimeringstj\u00e4nsten anger att legitimeringsmetoden som anv\u00e4ndes \
motsvarar tillitsniv\u00e5 3. Legitimeringstj\u00e4nsten \u00e4r inte godk\u00e4nd att leverera identitetsintyg enligt den, \
av Myndigheten f\u00f6r digital f\u00f6rvaltning, definierade tillitsniv\u00e5n 3. D\u00e4rf\u00f6r inneh\u00e5ller identitetsintyget \
som mottogs i samband med din legitimering en sj\u00e4lvdeklarerad legitimeringsstyrka.

sp.msg.authn-according-loa-low=Din legitimering utf\u00f6rdes enligt eIDAS tillitsniv\u00e5 \"l\u00e5g\".
sp.msg.authn-according-loa-substantial=Din legitimering utf\u00f6rdes enligt eIDAS tillitsniv\u00e5 \"v\u00e4sentlig\" (substantial).
sp.msg.authn-according-loa-high=Din legitimering utf\u00f6rdes enligt eIDAS tillitsniv\u00e5 \"h\u00f6g\".

sp.msg.authn-according-loa-eidas.desc=Legitimering inom det europeiska eID-samarbetet \u00e4r indelad i tre olika \"tillitsniv\u00e5er\" baserat p\u00e5 hur \
s\u00e4ker en legitimeringsmetod \u00e4r, d\u00e4r \"l\u00e5g\" \u00e4r den l\u00e4gsta niv\u00e5n, f\u00f6ljd av \"v\u00e4sentlig\" och slutligen \"h\u00f6g\" f\u00f6r h\u00f6gsta s\u00e4kerhet.

sp.msg.authn-according-loa.desc=Myndigheten f\u00f6r digital f\u00f6rvaltning (DIGG) definierar tre tillitsniv\u00e5er f\u00f6r legitimering, \
2, 3 och 4. En tillitsniv\u00e5 talar om enligt vilken styrka en legitimering utf\u00f6rs, d\u00e4r 4 \u00e4r den s\u00e4kraste niv\u00e5n. \
F\u00f6r att en legitimeringstj\u00e4nst ska f\u00e5 inkludera en given tillitsniv\u00e5 i ett identitetsintyg m\u00e5ste tj\u00e4nsten \
(och eID-utf\u00e4rdaren) vara godk\u00e4nd av DIGG f\u00f6r denna niv\u00e5.

The Agency for Digital Government defines three \"assurance levels\" for authentication, \
2, 3 and 4. These levels can be used to determine the strength of an authentication, where 4 is the most secure. \
In order for an identity provider to include any of these levels in an identity assertion it must have been \
approved by the Agency for Digital Government.

sp.msg.authn-according-notified=Legitimeringstj\u00e4nsten hos vilken du legitimerade dig \u00e4r notifierad enligt eIDAS process f\u00f6r godk\u00e4nnande av eID-leverant\u00f6rer. \
Detta inneb\u00e4r att legitimeringstj\u00e4nsten har granskats och godk\u00e4nts av andra medlemsl\u00e4nder under \u00f6verinseende av EU-kommissionen.

sp.msg.authn-according-non-notified=Legitimeringstj\u00e4nsten hos vilken du legitimerade dig \u00e4r kanske inte \u00e4r notifierad enligt eIDAS process f\u00f6r godk\u00e4nnande av eID-leverant\u00f6rer. \
En \"notifierad legitimeringstj\u00e4nst\" \u00e4r en legitimeringstj\u00e4nst som har granskats och godk\u00e4nts av andra medlemsl\u00e4nder under \u00f6verinseende av EU-kommissionen. \
Ocks\u00e5 legitimeringstj\u00e4nster som inte \u00e4r granskade och godk\u00e4nda kan leverera identitetsintyg inom eIDAS-federationen. \
Vi mottog ingen specific information som anger om din legitimering utf\u00f6rdes av en notifierad legitimeringstj\u00e4nst.
